k8-2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Break Test (2 minute @ each load levels)" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-1962728508">
            <stringProp name="49586">200</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="1569144">3270</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1760722573">
            <stringProp name="49586">200</stringProp>
            <stringProp name="50640">330</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="1545987">2940</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1403535149">
            <stringProp name="49586">200</stringProp>
            <stringProp name="53616">660</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="1543011">2610</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-420281712">
            <stringProp name="49586">200</stringProp>
            <stringProp name="56592">990</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="1539384">2280</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-765194129">
            <stringProp name="49586">200</stringProp>
            <stringProp name="1510368">1320</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="1516227">1950</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1123128250">
            <stringProp name="49586">200</stringProp>
            <stringProp name="1513344">1650</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="1513251">1620</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="2066344699">
            <stringProp name="49586">200</stringProp>
            <stringProp name="1516320">1980</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="1509624">1290</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1608253235">
            <stringProp name="49586">200</stringProp>
            <stringProp name="1540128">2310</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="56499">960</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1965440659">
            <stringProp name="49586">200</stringProp>
            <stringProp name="1543104">2640</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="53523">630</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1253992612">
            <stringProp name="49586">200</stringProp>
            <stringProp name="1546080">2970</stringProp>
            <stringProp name="30">30</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /Ping" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">20.85.130.165</stringProp>
          <stringProp name="HTTPSampler.port">4000</stringProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <intProp name="calcMode">0</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>60.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>